---
kind: method
id: M:Autodesk.Revit.DB.View3D.CanToggleBetweenPerspectiveAndIsometric
zh: 三维视图、3d视图
source: html/ddae373a-3669-7d71-d18f-725f92e251a1.htm
---
# Autodesk.Revit.DB.View3D.CanToggleBetweenPerspectiveAndIsometric Method

**中文**: 三维视图、3d视图

Checks whether this view can toggle between perspective and isometric.

## Syntax (C#)
```csharp
public bool CanToggleBetweenPerspectiveAndIsometric()
```

## Returns
True if this view can be toggled, false otherwise.

## Remarks
This view can only be toggled if no view specific elements are contained.